app/controllers/admin/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-03-27 10:43:32.359607"], ["updated_at", "2022-03-27 10:43:32.359607"]]