app/controllers/admin/courses_controller.rb

INSERT INTO "courses" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-03-27 10:45:35.270348"], ["updated_at", "2022-03-27 10:45:35.270348"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save