app/controllers/admin/students_controller.rb

  def index
    @q = Student.ransack(params[:id])
    @students = @q.result(distinct: true ).page(params[:page])
---
SELECT COUNT(DISTINCT "students"."id") FROM "students"
SELECT DISTINCT "students".* FROM "students" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "date_of_birth", "permanent_address", "local_address", "permanent_contact_number", "alternative_contact_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)