app/controllers/demos_controller.rb

SELECT "demos".* FROM "demos"
---
  def index
    @demos = Demo.all