app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "email", "date_of_birth", "permanent_address", "local_address", "permanent_contact_number", "alternative_contact_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "alternative_contact_number" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["alternative_contact_number", "213"], ["updated_at", "2022-03-27 08:02:40.712724"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)