app/models/user.rb

  def self.find_for_database_authentication(warden_condition)
    conditions = warden_condition.dup
    if (login = conditions.delete(:login))
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", {value: login.downcase}]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'usamak.mirza@gmail.com' OR lower(email) = 'usamak.mirza@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]